In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in c:\users\yugen\onedrive\desktop\python by krish naik\.venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\yugen\onedrive\desktop\python by krish naik\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\yugen\onedrive\desktop\python by krish naik\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp310-cp310-win_amd64.whl (11.3 MB)
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.3 MB 6.7 MB/s eta 0:00:02
   ------ --------------------------------- 1.8/11.3 MB 5.6 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.3 MB 5.4 MB/s eta 0:00:02
   ------------- -------------------------- 3.9/11.3 MB 5.3 MB/s eta 0:00:02
   ----------------- ---------------------- 5.0/11.3 MB 5.3 MB/s eta 0:00:02
   --------------------- ------------------ 6.0/11.3 MB 5.3 MB/s eta 0:00:02
   ------------------------ --------------- 7.1/11.3 MB 5.2 MB/s eta 0:00:01
   ---------------------------- ----------- 8.1/11.3 MB 5.2 MB/s eta 0:00:01
   -------------------------------- ------- 9.2/11.3 MB 5.1 MB/s eta 0:00:01
   ------------------------------------ --- 10.2/11.3 MB 5.1 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.3 MB 5.1 MB/s eta 0:00:01
   ---------------------------------------- 11.3/11.3 MB 5.0 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

#it have series and dataframe 
#Series - It is one dimensional array like object that can hold any data type. it is like coloumn in tables.

data =[2,3,4,5,3,5]
series = pd.Series(data)
print(series)

0    2
1    3
2    4
3    5
4    3
5    5
dtype: int64

In [2]:
#create series from dictionary

data = {'a':1, 'b':2, 'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [ ]:
#dataframes
#creating from dictionary containing list

demo = {
  'Name':['Pragati','Shubha','Archit'],
  'Age':[21,18,12],
  'Gender':['F','F','M']
}

df= pd.DataFrame(demo)
print(df)
print(type(df))

      Name  Age Gender
0  Pragati   21      F
1   Shubha   18      F
2   Archit   12      M
<class 'pandas.core.frame.DataFrame'>

In [10]:
csv1 =pd.read_csv('demo.csv')
csv1.head(3)

   ID         Name  Class  Math  Science  English
0   1  Ayesha Khan     10    89       92       85
1   2  Rahul Mehta     10    78       88       90
2   3   Simran Roy     10    95       91       87

In [11]:
csv1['Class']

0    10
1    10
2    10
3    10
4    10
Name: Class, dtype: int64

In [ ]:
csv1.at[2,'English']   # also use iloc , loc , iat

np.int64(87)

In [18]:
#data manipulation
#add column
csv1['Hindi']= [34,27,87,54,23]
csv1

   ID         Name  Class  Math  Science  English  Hindi
0   1  Ayesha Khan     10    89       92       85     34
1   2  Rahul Mehta     10    78       88       90     27
2   3   Simran Roy     10    95       91       87     87
3   4    Rohan Das     10    80       86       84     54
4   5   Neha Patel     10    76       90       88     23

In [19]:
#remove a column
csv1.drop('Hindi', axis=1, inplace=True)
csv1

   ID         Name  Class  Math  Science  English
0   1  Ayesha Khan     10    89       92       85
1   2  Rahul Mehta     10    78       88       90
2   3   Simran Roy     10    95       91       87
3   4    Rohan Das     10    80       86       84
4   5   Neha Patel     10    76       90       88

In [21]:
print(csv1.dtypes) #data type
print(csv1.describe())

ID          int64
Name       object
Class       int64
Math        int64
Science     int64
English     int64
dtype: object
             ID  Class       Math    Science    English
count  5.000000    5.0   5.000000   5.000000   5.000000
mean   3.000000   10.0  83.600000  89.400000  86.800000
std    1.581139    0.0   8.080842   2.408319   2.387467
min    1.000000   10.0  76.000000  86.000000  84.000000
25%    2.000000   10.0  78.000000  88.000000  85.000000
50%    3.000000   10.0  80.000000  90.000000  87.000000
75%    4.000000   10.0  89.000000  91.000000  88.000000
max    5.000000   10.0  95.000000  92.000000  90.000000